/*
 * Математичні оператори (+, -, *, /, %, **)
 */

/*
 ? Дано два числа 20 та 10.
 ? Проведіть над цими числами математичні операції (+ - / * %).
*/

// const numA = 20;
// const numB = 10;

//? Перевірте чи парні числа 15, 20, 45, 30.
// const numA = 15;
// const numB = 20;
// const numC = 45;
// const numD = 30;
/*
  ? Дано 90 хвилин, дізнайтеся скільки в цьому числі міститься годин і хвилин.
  ? Результат виведіть у консоль.
*/
// const totalMinutes = 90;

/*
 * Number, Number.parseInt(), Number.parseFloat()
 */

/* 
  ? Попросіть користувача ввести число.
  ? Виведіть результат у консоль.
  ? Приведіть рядок до числа.
*/

//? Даний рядок '24px', дістаньте з цього рядка ціле число.
// const str = '24px';

//? Даний рядок '25.5%', дістаньте з цього рядка дробове число.
// const str = '25.5%';

//? Спробуйте призвести до числа, рядок 'abc'.
// const str = 'abc';

//? Запросіть у користувача ввести два числа, додайте їх та виведіть результат у консоль.

/*
 * Math.floor, Math.ceil, Math.round, Math.max, Math.min, Math.pow(), Math.random().
 */

/*
  ? Дано число 23.5, застосуйте до нього різноманітні методи заокруглення.
  ? Протестуйте на числах, 23.3, 23.9
*/
// const number = 23.3;

/*
  ? Попросіть користувача ввести число та ступінь.
  ? Зведіть число до ступеня і виведіть результат у консоль.
*/

/*
  ? Згенеруйте рандомне число:
  ? від 0 до 1;
*/

//? Згенеруйте рандомне число. Мінімальне та максимально значення, отримати від користувача

// const generateRandomNumbure = (min, max) => {
//   return Math.round(min - 0.5 + Math.random() * (max - min + 1));
// };

// let count1 = 0;
// let count2 = 0;
// let count3 = 0;

// for (let i = 0; i < 100; i += 1) {
//   const randomNumber = generateRandomNumbure(1, 3);

//   switch (randomNumber) {
//     case 1: {
//       count1 += 1;
//       break;
//     }

//     case 2: {
//       count2 += 1;
//       break;
//     }

//     case 3: {
//       count3 += 1;
//       break;
//     }
//   }
// }

// console.log(`1: ${count1}`);
// console.log(`2: ${count2}`);
// console.log(`3: ${count3}`);
