/*
 * Створення об'єкта (конструктор, литерал).
 * Властивості, ключі (ім'я) та значення
 */

/*
 * Доступ до властивостей(obj.key, obj[key]).
 * Додавання та зміна властивостей
 */

/*
 * Методи об'єкта. this при зверненні до властивостей у методах
 */

/*
 * - changeTitle(newTitle) - змінює назву фільму
 * - addActor(newActor) - додає актора
 * - updateRating(newRating) - оновлює рейтинг фільму
 * - isAdult - перевіряє вікове обмеження на фільм
 */

/*
 * for...in, Object.keys, Object.values
 */

/*
 * Операція spread замість concat і slice. Копія масива. Об'єднання масивів
 */

//* Розпилення масиву у функцію

//* Розпилення складних типів

/*
 * Операція rest
 */

/*
 * Деструктуризація об'єктів
 */
/*
 * Глибока деструктуризація об'єктів
 */

/*
 * Паттерн об'єкта
 */
